{
    "_name_or_path": "TinyGPT",
    "architectures": [
      "GPT2LMHeadModel"
    ],
    "model_type": "gpt2",
    "vocab_size": 100,
    "n_positions": 64,
    "n_ctx": 64,
    "n_embd": 16,
    "n_layer": 1,
    "n_head": 1,
    "bos_token_id": 50256,
    "eos_token_id": 50256,
    "layer_norm_epsilon": 1e-5,
    "initializer_range": 0.02,
    "use_cache": true
  }
  