{
    "version": "1.0",
    "truncation": null,
    "padding": null,
    "added_tokens": [],
    "normalizer": {
      "type": "Sequence",
      "normalizers": []
    },
    "pre_tokenizer": {
      "type": "Sequence",
      "pretokenizers": []
    },
    "post_processor": null,
    "decoder": null,
    "model": {
      "type": "BPE",
      "vocab": {
        "<|endoftext|>": 0,
        "<|pad|>": 1,
        "A": 2,
        "B": 3,
        "C": 4,
        "D": 5,
        "E": 6,
        "F": 7,
        "G": 8,
        "H": 9,
        "I": 10,
        "J": 11,
        "K": 12,
        "L": 13,
        "M": 14,
        "N": 15,
        "O": 16,
        "P": 17,
        "Q": 18,
        "R": 19,
        "S": 20,
        "T": 21,
        "U": 22,
        "V": 23,
        "W": 24,
        "X": 25,
        "Y": 26,
        "Z": 27,
        "a": 28,
        "b": 29,
        "c": 30,
        "d": 31,
        "e": 32,
        "f": 33,
        "g": 34,
        "h": 35,
        "i": 36,
        "j": 37,
        "k": 38,
        "l": 39,
        "m": 40,
        "n": 41,
        "o": 42,
        "p": 43,
        "q": 44,
        "r": 45,
        "s": 46,
        "t": 47,
        "u": 48,
        "v": 49,
        "w": 50,
        "x": 51,
        "y": 52,
        "z": 53,
        "!": 54,
        "?": 55,
        ".": 56,
        ",": 57,
        "0": 58,
        "1": 59,
        "2": 60,
        "3": 61,
        "4": 62,
        "5": 63,
        "6": 64,
        "7": 65,
        "8": 66,
        "9": 67,
        "🙂": 68,
        "🙃": 69,
        "😀": 70,
        " ": 71,
        "[CLS]": 72,
        "[SEP]": 73,
        "[MASK]": 74,
        "[UNK]": 75,
        "[PAD]": 76,
        "foo": 77,
        "bar": 78,
        "baz": 79,
        "qux": 80,
        "lorem": 81,
        "ipsum": 82,
        "dolor": 83,
        "sit": 84,
        "amet": 85,
        "tiny": 86,
        "transformer": 87,
        "chatbot": 88,
        "🙂🙃": 89,
        "random": 90,
        "tokens": 91,
        "</s>": 92,
        "<s>": 93,
        "<unk>": 94,
        "<mask>": 95,
        "…": 96,
        "-": 97,
        ":": 98,
        "(": 99
      },
      "merges": []
    }
  }
  